TAL_INT_GIT/Sample Data/NUPCO/mmoutputreq/mmoutputreq

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:sap-com:document:sap:soap:functions:mc-style">
   <soapenv:Header/>
   <soapenv:Body>
      <urn:ZecsGetMatDataV1>
         <!--Optional:-->
         <LongTxt>x</LongTxt>
         <!--Optional:-->
         <Zdate>2020-12-14</Zdate>
         <!--Optional:-->
         <Ztime></Ztime>
      </urn:ZecsGetMatDataV1>
   </soapenv:Body>
</soapenv:Envelope>